{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 3,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 512,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "BertProcessing",
    "sep": [
      "</s>",
      1
    ],
    "cls": [
      "<s>",
      0
    ]
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "<unk>",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 500,
    "vocab": {
      "<s>": 0,
      "</s>": 1,
      "<unk>": 2,
      "<pad>": 3,
      "#": 4,
      "(": 5,
      ")": 6,
      "+": 7,
      "-": 8,
      ".": 9,
      "/": 10,
      "1": 11,
      "2": 12,
      "3": 13,
      "4": 14,
      "5": 15,
      "6": 16,
      "7": 17,
      "8": 18,
      "9": 19,
      "=": 20,
      "@": 21,
      "B": 22,
      "C": 23,
      "F": 24,
      "H": 25,
      "I": 26,
      "N": 27,
      "O": 28,
      "P": 29,
      "S": 30,
      "[": 31,
      "\\": 32,
      "]": 33,
      "c": 34,
      "e": 35,
      "i": 36,
      "l": 37,
      "n": 38,
      "o": 39,
      "r": 40,
      "s": 41,
      "##C": 42,
      "##(": 43,
      "##)": 44,
      "##=": 45,
      "##O": 46,
      "##N": 47,
      "##[": 48,
      "##@": 49,
      "##H": 50,
      "##]": 51,
      "##1": 52,
      "##F": 53,
      "##c": 54,
      "##n": 55,
      "##2": 56,
      "##3": 57,
      "##S": 58,
      "##s": 59,
      "##-": 60,
      "##l": 61,
      "##/": 62,
      "##I": 63,
      "###": 64,
      "##o": 65,
      "##+": 66,
      "##B": 67,
      "##r": 68,
      "##\\": 69,
      "##4": 70,
      "##i": 71,
      "##P": 72,
      "##5": 73,
      "##6": 74,
      "##e": 75,
      "##7": 76,
      "##8": 77,
      "##.": 78,
      "##9": 79,
      "##CC": 80,
      "##cc": 81,
      "##(C": 82,
      "##[C": 83,
      "##[C@": 84,
      "##H]": 85,
      "##O)": 86,
      "##=O)": 87,
      "##(=O)": 88,
      "##(C)": 89,
      "##c1": 90,
      "##[C@@": 91,
      "##[C@H]": 92,
      "##C(=O)": 93,
      "##[C@@H]": 94,
      "##C1": 95,
      "##2)": 96,
      "##1CC": 97,
      "##c1cc": 98,
      "##F)": 99,
      "##c2": 100,
      "##NC(=O)": 101,
      "##C[C@H]": 102,
      "##2CC": 103,
      "##(F)": 104,
      "##C[C@@H]": 105,
      "##CN": 106,
      "##(C(=O)": 107,
      "##(CC": 108,
      "##CC1": 109,
      "##(N": 110,
      "##cn": 111,
      "##C(=O)N": 112,
      "##(C)C": 113,
      "CC": 114,
      "##n1": 115,
      "##c2cc": 116,
      "##(O)": 117,
      "##=C": 118,
      "##OC": 119,
      "CO": 120,
      "##3)": 121,
      "##(C(=O)N": 122,
      "##[n": 123,
      "##[nH]": 124,
      "##c(": 125,
      "##c1n": 126,
      "##1C": 127,
      "##CCC": 128,
      "##CCN": 129,
      "##(=O)N": 130,
      "##2)C1": 131,
      "##c1cccc": 132,
      "##c(C": 133,
      "##1)": 134,
      "O=C": 135,
      "##cc1": 136,
      "##[C@@H]1CC": 137,
      "##(NC(=O)": 138,
      "##c3": 139,
      "##C2": 140,
      "##(C)C)": 141,
      "##N)": 142,
      "##CCCC": 143,
      "##[C@@H]1": 144,
      "CC(C)": 145,
      "##C2)": 146,
      "##OCC": 147,
      "##2C": 148,
      "##[C@@]": 149,
      "##[C@]": 150,
      "##(N)": 151,
      "##[C@H]1CC": 152,
      "##=CC": 153,
      "##[C@H](C)": 154,
      "##[C@H]1": 155,
      "##c1cn": 156,
      "##[C@@H](C)": 157,
      "##c2cccc": 158,
      "CCC": 159,
      "##N1CC": 160,
      "##l)": 161,
      "Cc1cc": 162,
      "##(F)(F)": 163,
      "##c2n": 164,
      "##c(C)": 165,
      "##C[C@H]1": 166,
      "##(C)(C)": 167,
      "##OC)": 168,
      "##c1ccccc1": 169,
      "##(CO)": 170,
      "##C1CC": 171,
      "CN": 172,
      "###N)": 173,
      "##3CC": 174,
      "##C1)": 175,
      "##CO": 176,
      "##CN(C(=O)": 177,
      "##c(F)": 178,
      "##(CN": 179,
      "##(C)CC": 180,
      "##C(=O)N1CC": 181,
      "C#": 182,
      "##C[C@@H]1": 183,
      "C[C@H]": 184,
      "##c2)": 185,
      "##NC(=O)N": 186,
      "O=C(N": 187,
      "##(CC)": 188,
      "##nc1": 189,
      "C[C@@H]": 190,
      "CC1": 191,
      "##OC(=O)": 192,
      "##cccc": 193,
      "##C1CC1": 194,
      "##=O": 195,
      "##[C@]1": 196,
      "##(F)F)": 197,
      "##CCO": 198,
      "##C)": 199,
      "##S(=O)": 200,
      "##[C@@]1": 201,
      "##[C@@H]2CC": 202,
      "Cc1n": 203,
      "##[C@H]2CC": 204,
      "##nn": 205,
      "##(CNC(=O)": 206,
      "##[C@@H]2": 207,
      "##c1ccc": 208,
      "COC(=O)": 209,
      "##C[C@@H]2": 210,
      "##CC(=O)N": 211,
      "##o1": 212,
      "##(C)C(=O)": 213,
      "C=": 214,
      "##[C@H]2": 215,
      "##ccc1": 216,
      "##C[C@H]2": 217,
      "##c1)": 218,
      "##C[C@H](C)": 219,
      "##=N": 220,
      "##n1cc": 221,
      "##2CC2)": 222,
      "##C(C)": 223,
      "##c(-": 224,
      "##c2cn": 225,
      "##c1c": 226,
      "##C[C@@H]1CC": 227,
      "##cn1": 228,
      "##CC2)": 229,
      "##CN1": 230,
      "##C[C@@H](C)": 231,
      "##N(C(=O)": 232,
      "##n2": 233,
      "##C[C@H]1CC": 234,
      "##c(Cl)": 235,
      "##CC2": 236,
      "##CCC1": 237,
      "##Cc1cc": 238,
      "##s1": 239,
      "##C2)C1": 240,
      "##c1ncc": 241,
      "C=CC": 242,
      "##[nH]1": 243,
      "##[C@H]1C": 244,
      "##CN1CC": 245,
      "##[N": 246,
      "##c2ccccc2": 247,
      "##(Cl)": 248,
      "##ncc": 249,
      "##(C#N)": 250,
      "##2C)": 251,
      "##CC1)": 252,
      "##(F)(F)F)": 253,
      "##[C@@H]1C": 254,
      "##n2)": 255,
      "##nn1": 256,
      "##C3)": 257,
      "##O1": 258,
      "##c1C": 259,
      "##NC(=O)C": 260,
      "##+]": 261,
      "##-]": 262,
      "##(CC(=O)N": 263,
      "##c(CN": 264,
      "##nc": 265,
      "##[N+]": 266,
      "##S(=O)(=O)": 267,
      "##(C(=O)N2CC": 268,
      "C[C@@H]1": 269,
      "##(C1)": 270,
      "##n(C)": 271,
      "##C[C@H]1C": 272,
      "##C[C@@H](O)": 273,
      "COc1cc": 274,
      "##(N)=O)": 275,
      "##N1": 276,
      "C=C": 277,
      "##(F)F": 278,
      "##C[C@H](O)": 279,
      "##CCN1": 280,
      "##C[C@H]2CC": 281,
      "##2(CC": 282,
      "##(C(=O)O)": 283,
      "##(-": 284,
      "##c3cc": 285,
      "##[C@@H](O)": 286,
      "##[C@H](O)": 287,
      "CCO": 288,
      "##(OC)": 289,
      "##CN(C": 290,
      "O=": 291,
      "##n1)": 292,
      "##2)CC1": 293,
      "##C=C": 294,
      "##cc2": 295,
      "##(N2CC": 296,
      "N#": 297,
      "##C[C@@H]1C": 298,
      "##(C)(C)C)": 299,
      "##[C@@H](C": 300,
      "##NC": 301,
      "##O-]": 302,
      "##[O-]": 303,
      "##CNC(=O)": 304,
      "##CC1CC": 305,
      "##c3cccc": 306,
      "##C(=O)O": 307,
      "##C2CC": 308,
      "##ccc2": 309,
      "O=C(C": 310,
      "O=C(": 311,
      "##[C@H](C": 312,
      "##C(C)(C)": 313,
      "##c(C(=O)N": 314,
      "##CN(CC": 315,
      "##3)C2)": 316,
      "CC[C@H]": 317,
      "##(C)(C)C": 318,
      "##cnc1": 319,
      "CS": 320,
      "##C(=O)N1": 321,
      "##[C@@H](C)C": 322,
      "##c2c(": 323,
      "##[N+](=O)": 324,
      "##[N+](=O)[O-]": 325,
      "##c2ncc": 326,
      "##(NC": 327,
      "##c[nH]": 328,
      "##[C@](C)": 329,
      "##c(O)": 330,
      "##C(=O)NCC": 331,
      "C#CC": 332,
      "##[C@@H]3": 333,
      "##[C@@](C)": 334,
      "##C(C)C": 335,
      "##C[C@@H]3": 336,
      "##[C@H](C)C": 337,
      "##C[C@H]3": 338,
      "C[C@@H]1CC": 339,
      "##OC1": 340,
      "##nc2": 341,
      "##[C@@]2": 342,
      "##cc1C": 343,
      "Cn1": 344,
      "##c1ccc(": 345,
      "##[C@H]3": 346,
      "##C(F)(F)": 347,
      "CC[C@@H]": 348,
      "##CCN(C(=O)": 349,
      "##3(CC": 350,
      "##4)": 351,
      "##NCC": 352,
      "##C[C@@H]2CC": 353,
      "##[C@]2": 354,
      "##c2ccccc2)": 355,
      "##N(C": 356,
      "##(=O)N1CC": 357,
      "##C12CC": 358,
      "CC1(C)": 359,
      "COC": 360,
      "##c2)C1": 361,
      "##CCN1CC": 362,
      "C[C@H]1": 363,
      "##(CCO)": 364,
      "##c1ccn": 365,
      "##C(C)(C)C": 366,
      "##/C=C": 367,
      "CC(C)(C)": 368,
      "##3CC3)": 369,
      "##2)c1": 370,
      "##n[nH]": 371,
      "##c1ccc(F)": 372,
      "##[S": 373,
      "CCOC(=O)": 374,
      "##C(": 375,
      "##cs": 376,
      "##CN1C(=O)": 377,
      "##(NC(=O)N": 378,
      "##[N+](=O)[O-])": 379,
      "##co": 380,
      "##NC(=O)C1": 381,
      "##c1ccccc1)": 382,
      "##[C@H]2C": 383,
      "##N(C)": 384,
      "##3CCC": 385,
      "##NC(=O)c1cc": 386,
      "##C2(CC": 387,
      "COCC": 388,
      "Cc1cn": 389,
      "##CCO1": 390,
      "CN1CC": 391,
      "CCN": 392,
      "##c1cccc2": 393,
      "##c(C#N)": 394,
      "##COC": 395,
      "Cc1": 396,
      "##[C@@H]2C": 397,
      "##=CC(=O)N": 398,
      "##c1cs": 399,
      "##S(=O)(=O)N": 400,
      "##@]": 401,
      "##n2cc": 402,
      "##C(=O)NC": 403,
      "##cnc2": 404,
      "##c2c(c1)": 405,
      "##CC2)C1": 406,
      "##CCN1C(=O)": 407,
      "##CO)": 408,
      "##C[C@H]2C": 409,
      "##C(=O)N(C)": 410,
      "##NC(=O)CC": 411,
      "##c(F)cc": 412,
      "CN(CC": 413,
      "##c(N": 414,
      "##1)N": 415,
      "##CCC2": 416,
      "##c(-c2cc": 417,
      "##no": 418,
      "O=C1": 419,
      "##CCC2)": 420,
      "##=N)": 421,
      "##CC12CC": 422,
      "C[C@H]1CC": 423,
      "##C[C@H](NC(=O)": 424,
      "##CN(C)": 425,
      "##C1CC1)": 426,
      "##N(CC": 427,
      "##[C@H](": 428,
      "##C1CCC1": 429,
      "##(C)C)C1": 430,
      "##CS": 431,
      "##CCN(CC": 432,
      "##3)C1": 433,
      "##c(C)c1": 434,
      "##no1": 435,
      "##[C@@H](": 436,
      "Cn1cc": 437,
      "##CO1": 438,
      "##(CN)": 439,
      "CC(=O)N": 440,
      "##[C@H](NC(=O)": 441,
      "##CCCCC1": 442,
      "##[C@H](CO)": 443,
      "##CCCO": 444,
      "##n3": 445,
      "##c3)": 446,
      "##c1no": 447,
      "##Cc2cc": 448,
      "##C[C@@H](NC(=O)": 449,
      "##(C(=O)NCC": 450,
      "##N(C)C(=O)": 451,
      "##=C(N": 452,
      "##cc1F": 453,
      "##[C@@H](CO)": 454,
      "O=C(CC": 455,
      "###N": 456,
      "##c1cncc": 457,
      "CN(C)": 458,
      "##(C)(=O)": 459,
      "##c(NC(=O)": 460,
      "CCCCC": 461,
      "##OCC1": 462,
      "##n2)C1": 463,
      "##CN(": 464,
      "##ncn": 465,
      "CN(C": 466,
      "##OCCO": 467,
      "##2)n1": 468,
      "##[C@H](N)": 469,
      "##C(=O)OC": 470,
      "##Br": 471,
      "##nc(C": 472,
      "##CC)": 473,
      "##c1ccc(C": 474,
      "##c3ccccc3": 475,
      "##c1c[nH]": 476,
      "Cc1cccc": 477,
      "##C2)CC1": 478,
      "##[C@@H](N)": 479,
      "CC[C@H](C)": 480,
      "##c1[nH]": 481,
      "##c1co": 482,
      "##[C@@H](NC(=O)": 483,
      "CC(=O)": 484,
      "##1CC1)": 485,
      "##c12": 486,
      "##C1=O": 487,
      "##c2c1": 488,
      "##C[C@@H](C": 489,
      "##c(CC": 490,
      "##CCNC(=O)": 491,
      "O=C(O)": 492,
      "##CCCC1": 493,
      "##/C=C/": 494,
      "##n1C": 495,
      "##2)cc1": 496,
      "##[C@H](CC": 497,
      "##cccc2": 498,
      "##N(": 499,
      "##CC(=O)N1CC": 500,
      "c1": 501,
      "##[C@H](C(=O)N": 502,
      "##COC1": 503,
      "##C(=O)O)": 504,
      "NC(=O)": 505,
      "##CN(C)C(=O)": 506,
      "##C[C@@H]2C": 507,
      "##C3": 508,
      "##CCCC(=O)N": 509,
      "##[C@@H](CC": 510,
      "CCn1": 511
    }
  }
}